numbers = [2, 6, 3, 14, 10, 4, 11, 16, 12, 5, 4, 16, 1, 0, 8, 16, 10, 10, 8, 5, 1, 11, 10, 10, 12, 0, 0, 6, 14, 8, 2, 12, 14, 5, 6, 12, 1, 2, 10, 14, 9, 1, 15, 1, 2, 14, 16, 6, 7, 5]

print(len(numbers))         #  выводим количество аргументов списка
print(numbers[-1])          #  выводим последний аргумент списка
print(numbers[::-1])        #  выводим список в обратном порядке
if 5 and 17 in numbers:     #  если 5 и 17 содержатся в списке
    print('YES')            #  выводим да
else:
    print('NO')             #  если нет выводим нет
del numbers[-1]             #  удаляем последний элемент списка
del numbers[0]              #  удаляем первый элемент списка
print(numbers)              #  выводим список
    